using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SpoloxInstall
{
    static class DictRegions
    {
        public static IDictionary<int, string> Dict = new Dictionary<int, string>()
        {
            { 1,"Азовский район" },
            { 2,"Аксайский район" },
            { 3,"Багаевский район" },
            { 4,"Белокалитвинский район" },
            { 5,"Боковский район" },
            { 6,"Верхнедонской район" },
            { 7,"Веселовский район" },
            { 8,"Волгодонской район" },
            { 45,"город Азов" },
            { 46,"город Батайск" },
            { 47,"город Волгодонск"},
            { 48,"город Гуково"},
            { 49,"город Донецк"},
            { 50,"город Зверево"},
            { 51,"город Каменск-Шахтинский"},
            { 52,"город Новочеркасск"},
            { 53,"город Новошахтинск"},
            { 44,"город Ростов-на-Дону"},
            { 54,"город Таганрог"},
            { 55,"город Шахты"},
            { 9,"Дубовский район"},
            { 10,"Егорлыкский район"},
            { 11,"Заветинский район"},
            { 12,"Зерноградский район"},
            { 13,"Зимовниковский район"},
            { 14,"Кагальницкий район"},
            { 15,"Каменский район"},
            { 16,"Кашарский район"},
            { 17,"Константиновский район"},
            { 18,"Красносулинский район"},
            { 19,"Куйбышевский район"},
            { 20,"Мартыновский район"},
            { 21,"Матвеево-Курганский район"},
            { 22,"Миллеровский район"},
            { 23,"Милютинский район"},
            { 24,"Морозовский район"},
            { 25,"Мясниковский район"},
            { 26,"Неклиновский район"},
            { 27,"Обливский район"},
            { 28,"Октябрьский район"},
            { 29,"Орловский район"},
            { 30,"Песчанокопский район"},
            { 31,"Пролетарский район"},
            { 32,"Ремонтненский район"},
            { 33,"Родионово-Несветайский район"},
            { 34,"Сальский район"},
            { 35,"Семикаракорский район"},
            { 36,"Советский район"},
            { 37,"Тарасовский район"},
            { 38,"Тацинский район"},
            { 39,"Усть-Донецкий район"},
            { 40,"Целинский район"},
            { 41,"Цимлянский район"},
            { 42,"Чертковский район"},
            { 43,"Шолоховский район"}
        };
    }
}
